<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img
 src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/alx-courses/aice/assets/Content_page_banner_blue_dots.png"
 alt="ALX Content Header"
 class="full-width-image"
/>
</div>

# Reading data across multiple tables

In this exercise, we will learn how to read data from a sample database for a digital media company called Chinook that has tables for artists, albums, media tracks, invoices, and customers.

## Learning objectives

By the end of this train, you should be able to:
- Read data from a single column in a single table.
- Read data from multiple columns in a single table.
- Read data from multiple columns in multiple tables.

In [1]:
!pip install pymysql
!pip install ipython-sql==0.4.1 prettytable==0.7.2
!pip install SQLAlchemy==1.4.49

Requirement already satisfied: SQLAlchemy==1.4.49 in c:\users\dell\anaconda3\new folder\lib\site-packages (1.4.49)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\dell\anaconda3\new folder\lib\site-packages (from SQLAlchemy==1.4.49) (3.0.1)

In [ ]:
!pip install ipython-sql

First, let's load our sample database: You can download the chinook zip file from [here](https://github.com/Explore-AI/Public-Data/blob/master/Data/SQL/Chinook_db.zip)

In [ ]:
import os

# Print the current working directory
print(os.getcwd())

In [ ]:
import os

# List all files in the current notebook's directory
print(os.listdir())

In [2]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

In [ ]:
%sql sqlite:///Chinook.sqlite

In [3]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

Here is a [view](https://www.lucidchart.com/pages/er-diagrams) of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://github.com/Explore-AI/Pictures/blob/master/sqlite-sample-database-color.jpg?raw=true"  style="width:500px";/>
<br>
<br>
    <em>Figure 1: Chinook ERD</em>
</div>

[Image source](https://www.sqlitetutorial.net/sqlite-sample-database/)

## Reading data from a database

When reading data from a database like the Chinook database, we can read from a single column in a single table, multiple columns in a single table, or multiple columns in various tables within the database.

Let's explore the differences between the above queries.

### 1. Reading data from a single column in a single table in the database.

Let's write a query that returns the names of all Chinook digital media store customers.

For this query, we would need to read data from the `FirstName` column in the `customers` table (see ER diagram above).

In [4]:
%%sql
SELECT name 
FROM sqlite_master 
WHERE type='table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]

In [5]:
%%sql
PRAGMA table_info(albums);

 * sqlite:///chinook.db
Done.

[(0, 'AlbumId', 'INTEGER', 1, None, 1),
 (1, 'Title', 'NVARCHAR(160)', 1, None, 0),
 (2, 'ArtistId', 'INTEGER', 1, None, 0)]

In [7]:
%%sql 

SELECT *
FROM artists
LIMIT 10; -- Remove this line to see the full result.

 * sqlite:///chinook.db
Done.

[(1, 'AC/DC'),
 (2, 'Accept'),
 (3, 'Aerosmith'),
 (4, 'Alanis Morissette'),
 (5, 'Alice In Chains'),
 (6, 'Antônio Carlos Jobim'),
 (7, 'Apocalyptica'),
 (8, 'Audioslave'),
 (9, 'BackBeat'),
 (10, 'Billy Cobham')]

In [8]:
%%sql
SELECT name FROM sqlite_master
WHERE type='table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]

### 2. Reading data from multiple columns in a single table in the database.
Let's write a query to find out when each Chinook employee was hired. 

Looking at the ER diagram above, for this query, we would need to read data from the `FirstName`, `LastName`, and `HireDate` column(s) in the `employees` table.

In [9]:
%%sql

SELECT FirstName, LastName, HireDate
FROM employees;

 * sqlite:///chinook.db
Done.

[('Andrew', 'Adams', '2002-08-14 00:00:00'),
 ('Nancy', 'Edwards', '2002-05-01 00:00:00'),
 ('Jane', 'Peacock', '2002-04-01 00:00:00'),
 ('Margaret', 'Park', '2003-05-03 00:00:00'),
 ('Steve', 'Johnson', '2003-10-17 00:00:00'),
 ('Michael', 'Mitchell', '2003-10-17 00:00:00'),
 ('Robert', 'King', '2004-01-02 00:00:00'),
 ('Laura', 'Callahan', '2004-03-04 00:00:00')]

In the above query, we have specified multiple columns by **separating each column name in the list with a comma**.

### 3. Reading data from multiple columns in multiple tables in the database.

Let's write a query that lists album titles and the corresponding artists.

Based on the ER diagram, for this query, we would need to read data from the `Title` column in the `albums` table and the `Name` column in the `artists` table where the `Artistid` in the `artists` table is the same as the `Artistid` in the `albums` table.

In [10]:
%%sql

SELECT albums.Title, 
        artists.Name
FROM 
        albums, artists
LIMIT 10; -- Remove this line to see the full result

 * sqlite:///chinook.db
Done.

[('For Those About To Rock We Salute You', 'AC/DC'),
 ('For Those About To Rock We Salute You', 'Accept'),
 ('For Those About To Rock We Salute You', 'Aerosmith'),
 ('For Those About To Rock We Salute You', 'Alanis Morissette'),
 ('For Those About To Rock We Salute You', 'Alice In Chains'),
 ('For Those About To Rock We Salute You', 'Antônio Carlos Jobim'),
 ('For Those About To Rock We Salute You', 'Apocalyptica'),
 ('For Those About To Rock We Salute You', 'Audioslave'),
 ('For Those About To Rock We Salute You', 'BackBeat'),
 ('For Those About To Rock We Salute You', 'Billy Cobham')]

In the above query, we used a dot convention to tell SQL which table each selected column belongs to. This method is particularly useful in cases where the specified tables have columns with the same name. For example, the `artists` table and the `albums` table both have an `ArtistId` field.

However, the query above doesn't seem to have provided what we wanted. If we take a closer look and remove the `LIMIT` keyword, we  notice that each artist has written every album in the table (despite other artists having written the same album). 

This is because we need to align the records between the tables, making sure that the relevant records in one table correspond to the correct records in the second table. We can achieve this by using the `WHERE` clause to connect the tables using a common field between the two tables.

The query would look like this:

```SQL
SELECT table1.field1, table2.field3 
FROM table1, table2
WHERE table1.field1_id = table2.field1_id;
```

Let's rewrite the above query, but this time using the `WHERE` clause to align the records **where the `Artistid` in the `artists` table is the same as the `Artistid` in the `albums` table**.

In [11]:
%%sql

SELECT albums.Title, artists.Name
FROM albums, artists
WHERE artists.Artistid = albums.Artistid
LIMIT 10; -- Remove this line to see the full result

 * sqlite:///chinook.db
Done.

[('For Those About To Rock We Salute You', 'AC/DC'),
 ('Balls to the Wall', 'Accept'),
 ('Restless and Wild', 'Accept'),
 ('Let There Be Rock', 'AC/DC'),
 ('Big Ones', 'Aerosmith'),
 ('Jagged Little Pill', 'Alanis Morissette'),
 ('Facelift', 'Alice In Chains'),
 ('Warner 25 Anos', 'Antônio Carlos Jobim'),
 ('Plays Metallica By Four Cellos', 'Apocalyptica'),
 ('Audioslave', 'Audioslave')]

Unlike before, the returned data are aligned perfectly between both tables. We were able to get all albums and the corresponding artists.

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/refs/heads/master/ALX_banners/ALX_Navy.png"  style="width:100px"  ;/>
</div>